Repository: hyejin1653/TCPFileTransfer-master
Catalog: TCP File Transfer/LanguageManager/Languages/Lang_*.resx
Languages: tr

# btnReceiveFile
source: Wait for File...
tr: Dosya Bekle...

# btnSelectFile
source: Select...
tr: Dosya Seç

# btnSelectSaveLocation
source: Select...
tr: Kayıt Yeri Seç

# btnSendFile
source: Send File
tr: Dosyayı Gönder

# labelFileLocation
source: File
tr: Dosya

# labelReceiverIPAdress
source: IP Address
tr: IP Adresi

# labelSaveLocation
source: Save Location
tr: Kayıt Yeri

# labelSenderIPAdress
source: IP Address
tr: IP Adresi

# MainView
source: File Transfer
tr: Dosya Transfer

# TabPageReceiver
source: Receive File
tr: Dosya Al

# TabPageSender
source: Send File
tr: Dosya Gönder

source: Cancel Sending
tr: Göndermeyi İptal Et

# CancelTransfer
source: Cancel the Transfer
tr: Transferi İptal Et

source: Cancel Waiting
tr: Beklemeyi İptal Et

source: File Request Has Came
tr: Dosya İsteği Geldi

# FileRequestJustComeUpWaitingUserResponse
source: File request just came up, waiting user response...
tr: Dosya isteği geldi, kullanıcıdan yanıt bekleniyor...

# FileSending
source: File Being Sending...
tr: Dosya Gönderiliyor...

# FileWaitingWasCancelled
source: File Waiting Was Cancelled by User
tr: Dosya Bekleme İptal Edildi

source: Waiting for File...
tr: Dosya Bekleniyor...

# InvalidFilenameMessage
source: Please select a valid file.
tr: Lütfen geçerli bir dosya seçiniz.

# InvalidFilenameMessageTitle
source: Invalid File
tr: Geçersiz Dosya

# InvalidFormInputMessage
source: Please check the data you have entered on the form.
tr: Lütfen girdiğiniz bilgileri kontrol ediniz.

# InvalidFormInputMessageTitle
source: Invalid Data Entry
tr: Geçersiz Veri Girişi

# InvalidIpAddressMessage
source: Please enter a valid IP address.
tr: Lütfen geçerli bir IP adresi giriniz.

# InvalidIpAddressMessageTitle
source: Invalid IP Address
tr: Geçersiz IP Adresi

# InvalidPortNumberMessage
source: Please enter a valid port number.
tr: Lütfen geçerli bir port numarası giriniz.

# InvalidPortNumberMessageTitle
source: Invalid Port Number
tr: Geçersiz Port Numarası

# InvalidSaveLocationMessage
source: Please select a valid save location.
tr: Lütfen geçerli bir kayıt dizini seçiniz.

# InvalidSaveLocationMessageTitle
source: Invalid Save Location
tr: Geçersiz Kayıt Dizini

# ReceiverAskForReceiveFile
source: Do you want to receive the file "{0}" which is {1} in size?
tr: "{0}" ismindeki {1} boyutundaki dosyayı almak istiyor musunuz?

# ReceiverAskForReceiveFileTitle
source: Do You Want to Receive The File?
tr: Dosya alınsın mı?

# ReceiverCancelledByUser
source: The file receiving cancelled by user.
tr: Dosya alımı kullanıcı tarafından iptal edildi.

# ReceiverCancelledByUserTitle
source: Receive Cancelled
tr: İşlem İptal Edildi

# ReceiverCompleted
source: The file received successfully.
tr: Dosya başarıyla alındı.

# ReceiverCompletedTitle
source: Receive Completed
tr: İşlem Tamamlandı

# ReceiverCouldntReadStream
source: The file could not be received because the data could not be read from the stream.
tr: Akıştan veri okunamadığı için dosya alınamadı.

# ReceiverCouldntReadStreamTitle
source: File Read Error
tr: Veri Okuma Hatası

# ReceiverException
source: An unknown error has occurred while receiving the file: {0}
tr: Dosya alınırken bilinmeyen bir sorun oluştu: {0}

# ReceiverExceptionTitle
source: Unknown Error
tr: Beklenmeyen Bir Hata Oluştu

# ReceiverFailed
source: The file couldn't be received due to that either the remote user cancelled or the connection is lost.
tr: Karşı taraf bağlantıyı iptal ettiği için veya bağlantı koptuğu için dosya alınamadı.

# ReceiverFailedTitle
source: Receive Failed
tr: İşlem Tamamlanamadı

# ReceiverFileRejectedByUser
source: File receiving was cancelled at your request.
tr: Dosya alımını kabul etmediğiniz için dosya alımı iptal edildi.

# ReceiverFileRejectedByUserTitle
source: Receive Cancelled
tr: İşlem İptal Edildi!

# ReceiverIOException
source: The file couldn't be received due to I/O error which is can cause the invalid save location or other write exceptions.
tr: Kayıt dizininden veya başka bir nedenden dolayı G/Ç hatası meydana geldiği için dosya alınamadı.

# ReceiverIOException10054
source: The file couldn't be sent due to either the remote user cancelled or the connection lost.
tr: Karşı taraf bağlantıyı iptal ettiği için veya bağlantı koptuğu için dosya gönderilemedi.

# ReceiverIOException10054Title
source: The File Could Not Send
tr: Dosya Gönderilemedi

# ReceiverIOExceptionTitle
source: I/O Error
tr: G/Ç Hatası

# SenderArgumentException
source: The file could not be sent due to the error that occurred in the sender argument. Please try again after resetting your settings and restarting the application.
tr: Gönderme parametrelerinde meydana gelen sorundan dolayı gönderme işlemi yapılamıyor. Lütfen Ayarlarınızı gözden geçirip programı yeniden başlattıktan sonra işleminizi tekrarlayın.

# SenderArgumentExceptionTitle
source: Argument Exception
tr: Argüman Hatası

# SenderArgumentNullException
source: The file could not be sent because of the invalid argument of sender. Please try again after resetting your settings and restarting the application.
tr: Gönderme parametrelerinde geçersiz parametreden dolayı gönderme işlemi yapılamıyor. Lütfen Ayarlarınızı gözden geçirip programı yeniden başlattıktan sonra işleminizi tekrarlayın.

# SenderArgumentNullExceptionTitle
source: Argument Invalid Exception
tr: Geçersiz Argüman Hatası

# SenderCancelledByUser
source: The file sending was cancelled at your request.
tr: Dosya gönderme kullanıcı tarafından iptal edildi.

# SenderCancelledByUserTitle
source: The Operation Cancelled
tr: İşlem İptal Edildi

# SenderCompleted
source: The file sent successfully.
tr: Dosya başarıyla gönderildi.

# SenderCompletedTitle
source: The Operation Completed
tr: İşlem Tamamlandı

# SenderConnectError
source: Could not connect to IP address due to the one of the following reasons: 1- The remote user did not switch the program to the file wait mode. 2- The IP address or port number wasn't match with the remote user. 3- The remote user did not configure the port forwarding. 4- You or remote user have no internet connection.
tr: İstenilen IP adresiyle bağlantı sağlanamadı. Olası nedenler: 1- Karşıdaki kullanıcı dosya bekleme moduna geçmemiş olabilir. 2- IP adresi veya port numarası eşleşmemiş olabilir. 3- Karşıdaki kullanıcı gerekli port yapılandırmasını yapmamış olabilir. 4- İnternet bağlantınız veya karşı tarafın internet bağlantısı olmayabilir.

# SenderConnectErrorTitle
source: Connection Error
tr: Bağlantı Hatası

# SenderCouldntWriteToStream
source: The file could not be sent due to cannot write data to the stream.
tr: Akışa veri yazılamadığı için dosya gönderilemedi.

# SenderCouldntWriteToStreamTitle
source: Stream Write Error
tr: Veri Yazma Hatası

# SenderDirectoryNotFoundException
source: The directory you specified could not be found. Please make sure you select a valid save path.
tr: Belirtilen dizin bulunamadı. Lütfen geçerli bir dosya seçtiğinize emin olun.

# SenderDirectoryNotFoundExceptionTitle
source: Directory Not Found Exception
tr: Geçersiz Dizin Hatası

# SenderException
source: Unexpected error occurred while sending file: {0}
tr: Dosya gönderilirken bilinmeyen bir hata oluştu: {0}

# SenderExceptionTitle
source: Unexpected Error Occurred
tr: Beklenmeyen Bir Hata Oluştu

# SenderFailed
source: Error occurred while sending file.
tr: Dosya gönderilirken hata oluştu.

# SenderFailedTitle
source: The Send Failed
tr: Dosya Gönderme Hatası

# SenderIOException
source: The file couldn't be sent due to I/O error which is can cause the invalid file location or other read exceptions.
tr: Seçtiğiniz dosya bulunamadığından veya dosyayı okuma izni olmadığından dolayı G/Ç hatası meydana geldi ve dosya gönderilemedi.

# SenderIOExceptionError10054
source: The file couldn't be sent due to that either the remote user cancelled or the connection is lost.
tr: Karşı taraf bağlantıyı iptal ettiği için veya bağlantı koptuğu için dosya gönderilemedi.

# SenderIOExceptionError10054Title
source: Connection Error
tr: Bağlantı Hatası

# SenderIOExceptionTitle
source: I/O Error
tr: G/Ç Hatası

# SenderPathTooLongException
source: The file sending couldn't be started due to selected path is too long. Please select a shorter path and try again.
tr: Dosya yolu çok uzun olduğu için dosya gönderme işlemine başlanamadı. Lütfen daha kısa bir yol ile yeniden deneyin.

# SenderPathTooLongExceptionTitle
source: Path Too Long Exception
tr: Dosya Yolu Hatası

# SenderUnauthorizedAccessException
source: The file couldn't be sent due to the unauthorized exception which can prevent the file to being read. Please try again after restarting the application with administrator privileges.
tr: Gerekli yetkiler bulunmadığı için dosya gönderilemedi. Programı yönetici olarak çalıştırıp tekrar göndermeyi deneyin.

# SenderUnauthorizedAccessExceptionTitle
source: Unauthorized Exception
tr: Güvenlikten Kaynaklı Hata

source: second
tr: saniye

# AppName
source: File Transfer
tr: Dosya Transfer

# GroupBoxAboutApp
source: About File Transfer App
tr: Dosya Transfer Uygulaması Hakkında

# GroupBoxAboutDeveloper
source: About Developer
tr: Geliştirici Hakkında

# labelAllRightReserved
source: © {0} {1} - All Right Reserved
tr: © {0} {1} - Tüm Hakları Saklıdır

# labelAppNameAndVersion
source: {0} - Version {1}
tr: {0} - Versiyon {1}

# labelDeveloperName
source: Firat Eski / @firateski / firateski@outlook.com
tr: Fırat Eşki / @firateski / firateski@outlook.com

# TabPageAbout
source: About
tr: Hakkında

# labelDeveloperGithubProfile
source: Developer Github Profile: @FiratEski
tr: Geliştirici Github Profili: @FiratEski

# labelDeveloperWebSite
source: Developer Website: FiratEski.com
tr: Geliştirici Web Sitesi: FiratEski.com

# txtFileLocation
source: Click to select file...
tr: Dosya seçmek için tıklayın...

# txtSaveLocation
source: Click to select save location...
tr: Kayıt yeri seçmek için tıklayın...
